Revit 2027 API
AssemblyMemberDifferentCategory Properties
The AssemblyMemberDifferentCategory type exposes the following members.
Properties
Name | Description
CategoryId1 |  Category id of the first assembly member
CategoryId2 |  Category id of the second assembly member
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from AssemblyMemberDifference)
Top
See Also
Reference
AssemblyMemberDifferentCategory Class
Autodesk.Revit.DB Namespace